{
  "backend/main.mo": "Motoko canister managing user profiles and booking requests with permission checks for users and admins.",
  "feature_evidence.json": "Feature evidence report describing AMP page requirements, canonical linking, indexing, and related test mappings.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend files.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Frontend deployment checklist including build steps, smoke tests, troubleshooting, and AMP validation steps.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Main HTML entrypoint including Google verification and AMP discovery link to /amp/index.html.",
  "frontend/public/amp/index.html": "Standalone AMP‑compliant marketing page with required AMP scripts, boilerplate, and styled static content.",
  "frontend/public/robots.txt": "Robots rules allowing full crawling and referencing sitemap.xml.",
  "frontend/public/sitemap.xml": "Sitemap listing the canonical root and AMP landing page for indexing.",
  "frontend/src/App.tsx": "Root React component switching between marketing and admin views using local state.",
  "frontend/src/components/BookingForm.tsx": "Booking form component handling input state, submission via React Query, and success feedback.",
  "frontend/src/components/ContactSection.tsx": "Renders a contact section showing address, phone, email, and hours using constants and icons.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button handling Internet Identity authentication and UI states.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of service cards with icons and descriptions for various travel services.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with company info, quick links, and contact details.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive header with logo, navigation, mobile menu, and admin navigation.",
  "frontend/src/constants/contact.ts": "Exports business contact constants for email and phone numbers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries.",
  "frontend/src/hooks/useAdminBookingRequests.ts": "Fetches all booking requests for admin users using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login/clear functions, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Fetches the caller’s user role via the backend actor.",
  "frontend/src/hooks/useSubmitBookingRequest.ts": "Mutation hook to submit booking requests and refresh admin queries on success.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AdminRequestsPage.tsx": "Admin-only booking request page with authentication, role checks, loading states, and error handling UI.",
  "frontend/src/pages/MarketingPage.tsx": "Public marketing landing page with hero section, services, booking form, contact info, and smooth scroll navigation.",
  "frontend/src/utils/assetUrl.ts": "Utility for generating correct static and generated asset URLs based on the app’s base path.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, shadows, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing AMP-related fixes, features, known issues, and requested improvements."
}