{
  "backend/main.mo": "Implements access-controlled user profiles and booking request storage, with admin-only queries for viewing all bookings.",
  "feature_evidence.json": "Records feature verification metadata for adding a Google Search Console meta tag to frontend/index.html.",
  "frontend-file-summaries.txt": "Lists short summaries for all frontend files describing styling, components, hooks, and configuration.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Provides step-by-step deployment instructions and smoke tests for verifying the frontend and backend.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Static HTML entrypoint including Google site verification, metadata, and script loader for the React app.",
  "frontend/src/App.tsx": "Controls simple view switching between the marketing page and admin requests page.",
  "frontend/src/components/BookingForm.tsx": "Implements a full booking request form with validation, submission logic, and success feedback.",
  "frontend/src/components/ContactSection.tsx": "Displays address, phone, email, and hours using business contact constants.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button handling authentication states and retry logic.",
  "frontend/src/components/ServicesSection.tsx": "Renders four service cards showcasing travel-related offerings with icons.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with branding, quick links, and contact info using constants for email and phone.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive header with logo, navigation, admin button, and mobile menu toggle.",
  "frontend/src/constants/contact.ts": "Exports email and phone contact constants used across the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useAdminBookingRequests.ts": "Fetches all booking requests for admin users using the actor and role checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Defines a query to fetch the caller's user role via the backend actor.",
  "frontend/src/hooks/useSubmitBookingRequest.ts": "Mutation hook to submit booking requests and invalidate admin requests cache.",
  "frontend/src/index.css": "Defines global Tailwind styles and custom CSS variables for the site's color theme.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminRequestsPage.tsx": "Admin page that checks identity and role, displays booking requests, and handles access states.",
  "frontend/src/pages/MarketingPage.tsx": "Renders the main marketing page with hero, services, booking, and contact sections, using smooth scrolling and shared layout components.",
  "frontend/src/utils/assetUrl.ts": "Provides helpers for generating correct static and generated asset URLs based on environment.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks overall project metadata, features, and state including a pending Google Search Console verification tag request."
}