{
  "backend/main.mo": "Motoko canister providing user profile management and booking-request handling with permission checks using AccessControl.",
  "feature_evidence.json": "Feature-evidence report mapping deployment-related files, components, and acceptance test IDs for publishing the latest app version.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files including pages, components, hooks, utilities, and deployment documentation.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Step‑by‑step frontend deployment and verification guide including build steps, smoke tests, troubleshooting, and REQ‑11 criteria.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Basic HTML page loading the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Root component toggling between the marketing page and the admin requests page via simple state.",
  "frontend/src/components/BookingForm.tsx": "Comprehensive booking form component handling input state, submission via React Query, and success feedback.",
  "frontend/src/components/ContactSection.tsx": "Contact section displaying address, clickable phone/email, and hours using business constants.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and automatic session recovery.",
  "frontend/src/components/ServicesSection.tsx": "Service showcase section rendering four service cards with icons and descriptions.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with company info, quick links, and contact details using constants.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive site header with logo, navigation, and mobile menu handling.",
  "frontend/src/constants/contact.ts": "Exports business contact email and phone values as constants.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useAdminBookingRequests.ts": "Fetches all booking requests for admin users using the actor and role checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a query hook to fetch the caller's user role from the backend.",
  "frontend/src/hooks/useSubmitBookingRequest.ts": "Provides a mutation to submit a booking request and invalidates admin request queries on success.",
  "frontend/src/index.css": "Defines Tailwind base styles and a warm color theme with light and dark mode variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminRequestsPage.tsx": "Admin dashboard page that checks auth and role, displaying booking requests or access messages.",
  "frontend/src/pages/MarketingPage.tsx": "Main marketing page assembling header, hero, services, booking form, contact section, and footer with smooth scrolling and generated asset support.",
  "frontend/src/utils/assetUrl.ts": "Utility to generate normalized asset URLs, including helper for generated assets.",
  "frontend/src/utils/urlParams.ts": "Provides functions to read, store, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata describing requirements, features, business details, and known deployment issues."
}